Мобильная_инвентаризация/src/Documents/ИнвентаризацияДляМП/ИнвентаризацияДляМП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИнвентаризацияДляМП</name>
  <tabularSections>
    <name>ОсновныеСредства</name>
    <attributes>
      <name>ОсновноеСредство</name>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>План</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Факт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Мобильная_инвентаризация/src/InformationRegisters/Штрихкоды/Штрихкоды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Штрихкоды</name>
  <resources>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнвентарныйНомер</name>
    <type>
      <types>CatalogRef.ИнвентарныеНомераОС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипШтрихкода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Мобильная_инвентаризация/src/Documents/ИнвентаризацияДляМП/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Перем Компонента;

&НаСервере
Функция ЭтоТСД()
	Возврат Константы.ИспользоватьСканерТСД.Получить();
КонецФункции

#Если МобильноеПриложениеКлиент  Тогда

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЭтоТСД() Тогда
	
		Попытка
        	ПодключитьВнешнююКомпоненту("ОбщийМакет.AddIn", "LibData", ТипВнешнейКомпоненты.Native);
        	Компонента = Новый("AddIn.LibData.AddInNativeBEN");
       		//Компонента.StartGetScan();
			Компонента.StartMyGetScan("DATA_SCAN","com.hht.emdk.datawedge.data_string");
			//Компонента.StartMyGetScan("scan.rcv.message","data");
			//Сообщить(Компонента.IsEnabled);
			//Компонента.StartGetKeyEvent();
   		Исключение
        	Сообщить("драйвер сканирования не смог создать подключения-- сканирование на текущем устройстве работать не будет");
		КонецПопытки;
	
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	Если ЭтоТСД() Тогда
			
		Если Событие="BarcodeDecodeData" тогда 
            ШК=Данные;
			ОС = НайтиОсновноеСредствоПоШтрихкоду(ШК); 
			Если НЕ ОС.Пустая() Тогда 
				НоваяСтрока = Объект.ОсновныеСредства.Добавить();
				НоваяСтрока.ОсновноеСредство = ОС;
				НоваяСтрока.Факт = 1;
			КонецЕсли;
    	КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Сообщить("ОбработкаОповещения");
	
КонецПроцедуры

#конецесли

&НаКлиенте
Процедура ПоискПоШтрихкоду(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Функция НайтиОсновноеСредствоПоШтрихкоду(Штрихкод)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Штрихкоды.Объект.Ссылка КАК Ссылка
	               |ИЗ
	               |	РегистрСведений.Штрихкоды КАК Штрихкоды
	               |ГДЕ
	               |	Штрихкоды.Штрихкод ПОДОБНО &Штрихкод";
	
	Запрос.УстановитьПараметр("Штрихкод", "%"  + Строка(СокрЛП(Штрихкод)) + "%");
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		ОсновноеСредство = Результат.Ссылка;
	Иначе
		ОсновноеСредство = Справочники.ОсновныеСредства.ПустаяСсылка();
	КонецЕсли;
	
	Возврат ОсновноеСредство; 
	
КонецФункции
